posts/blog-comments.html
<!doctype html>
<html lang="en-us" class=scroll-smooth data-default-appearance=light data-auto-appearance=true>
  <head>
    
    <!-- Clicky -->
    <!-- Clicky -->
    <meta charset="utf-8">
    <title>Luca's blog - Home</title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="author" content="Luca Cambiaghi" />
    <meta name="description" content="Luca&#39;s blog" />
    <meta name="keywords" content="" />
    <link rel="stylesheet" href="https://lucacambiaghi.com/static/style.css" type="text/css" />
    <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css">
    
  </head>

  <body class="flex flex-col h-screen px-6 m-auto text-lg leading-7 bg-neutral text-neutral-900 sm:px-14 md:px-24 lg:px-32 dark:bg-neutral-800 dark:text-neutral max-w-7xl">
    
    <div id=the-top class="absolute flex self-center">
  <a class="px-3 py-1 text-sm -translate-y-8 rounded-b-lg bg-primary-200 dark:bg-neutral-600 focus:translate-y-0" href=#main-content>
    <span class="font-bold ltr:pr-2 rtl:pl-2 text-primary-600 dark:text-primary-400">&darr;
    </span>Skip to main content
  </a>
</div>

<header class="flex justify-between py-6 font-semibold sm:items-center sm:py-10 text-neutral-900 dark:text-neutral print:hidden">
  <div><a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/index.html">Luca</a></div>
<nav>
  <ul class="flex list-none sm:flex-row">
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/posts.html">posts</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/emacsd.html">emacs</a>
    </li>
    <span class="px-2 text-primary-500">&#183;</span>
    <li class="mb-1 ltr:text-right rtl:text-left sm:mb-0 ltr:sm:mr-7 ltr:sm:last:mr-0 rtl:sm:ml-7 rtl:sm:last:ml-0">
      <a class="decoration-primary-500 hover:underline hover:decoration-2 hover:underline-offset-2" href="/nix.html">nix</a>
    </li>
  </ul>
</nav>
</header>

    

    <main id="main" class="relative grow">
      
<article class="post">
  <h1 class="mt-0 text-4xl font-extrabold text-neutral-900 dark:text-neutral">
    Adding comments to the blog
  </h1>
  <div class="mt-8 mb-8 text-base text-neutral-500 dark:text-neutral-400 print:hidden">
    <div class="flex flex-row flex-wrap items-center">
      <time> Jun 07, 2020
      </time>
      <span class="px-2 text-primary-500">&#183;</span>
      <span title="tags">(clojurescript react)
      </span>
    </div>
  </div>

  <section class="flex flex-col max-w-full mt-0 prose lg:flex-row dark:prose-invert">
    <div class="min-w-0 min-h-0 max-w-prose">
      
<div id="outline-container-the-requirements" class="outline-2">
<h2 id="the-requirements">The requirements</h2>
<div class="outline-text-2">
<p>
I spent a day trying to integrate comments on this blog.
As always, things were simple but since I am a terrible web developer I spent a lot of time figuring out how to do it.
This gave me the opportunity to learn how to debug my clojurescript web app and to learn something about React so that is good!
</p>

<p>
I wanted to add comments at the end of my posts so I could gather feedback on what I write, to know whether I helped a random stranger or if something about my process could be improved.
My requirements for the commenting system I wanted to add were the following:
</p>
<ol class="org-ol">
<li>Free: I did not want to pay a monthly fee for my small blog with few monthly pageviews</li>
<li>Lightweight: my website's load speed should not suffer</li>
<li>No ads: my readers should have no waiting time to leave a quick comment</li>
<li>No login required: as above, I don't want to require my readers to have a Disqus or Github account</li>
<li>Simple, no backend installation: I wanted to keep my simple JAMstack setup with Netlify</li>
</ol>

<p>
It is not a small list when you look at it.
The thing is that I would not accept a solution which compromised on even one of the above points.
</p>
</div>
</div>

<div id="outline-container-good-solutions" class="outline-2">
<h2 id="good-solutions">Good solutions</h2>
<div class="outline-text-2">
<p>
The most popular solution for blogs is by far Disqus.
It is simple and free, however it is not lightweight and it has ads(!!).
They also have a bad reputation of not being privacy focused. Discarded.
</p>

<p>
One project I really liked was <a href="https://utteranc.es/">utterances</a>, which allows you to store the comments in a github repo.
It did not seem super trivial to integrate with my Reagent setup but it was a simple and elegant solution.
However, it compromised on requirement 4: you need a Github account to comment. I kept looking.
</p>

<p>
I found another interesting <a href="https://healeycodes.com/adding-comments-to-gatsby-with-netlify-and-github/">solution</a> which made us of Netlify forms and functions.
When a commenter would post a comment, it would trigger a new website build.
Comments are filtered for spam by Netlify and are stored in a JSON file on Github.
However, again, it was not simple to integrate in my setup as the Netlify functions can only be written in Javascript.
I found a good <a href="https://github.com/healeycodes/gatsby-serverless-comments">reference</a> to express functions in clojurescript and compile them and I was about to experiment to learn about serverless and lambda functions.
I liked the low-level idea of not relying on any service at all.
However, before diving into this project, I decided to try out a service which looked very simple AND respected all my requirements.
</p>
</div>
</div>

<div id="outline-container-the-winner" class="outline-2">
<h2 id="the-winner">The winner</h2>
<div class="outline-text-2">
<p>
I decided to try <a href="https://talk.hyvor.com/">Hyvor Talk</a>, they offer a similar service to Disqus but privacy-focused.
It does not look lightweight when you see a demo site but then you found out that you can load the component "on scroll" or by clicking a button. Nice!
They have a free tier, which seemed to be perfect for my use case.
</p>

<p>
The integration was quite simple: just add this piece of HTML to your blog posts and if they have a canonical URL everything will work out of the box.
Yeah, well, it is not easy with a single page application.
My blog posts are React components, where the HTML is set with the <code>dangerouslySetInnerHTML</code> function.
Fair enough, I said, I will write that piece of HTML in each of my post.
Then I found out that if the innerHTML contains a <code>&lt;script&gt;</code> tag, it will be skipped. Damn.
</p>

<p>
What I found out shortly after is that Hyvor Talk provides their own React component to embed the comments in your website!
After a bit of research I found out that <code>shadow-cljs</code> makes it extremely easy to install an existing React component and include it in your SPA!
</p>

<p>
Firs I installed the component with:
</p>
<div class="org-src-container">
<pre class="src src-sh">yarn add hyvor-talk-react
</pre>
</div>

<p>
And this is my Reagent code:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span class="org-keyword">ns</span> <span class="org-type">app.core</span>
  (<span class="org-clojure-keyword">:require</span> [<span class="org-string">"hyvor-talk-react"</span> <span class="org-clojure-keyword">:as</span> HyvorTalk]))

(<span class="org-keyword">defn-</span> <span class="org-function-name">comments</span> [post-id]
  [<span class="org-clojure-keyword">:&gt;</span> <span class="org-type">HyvorTalk</span>/Embed {<span class="org-clojure-keyword">:websiteId</span> 123 <span class="org-clojure-keyword">:id</span> post-id <span class="org-clojure-keyword">:loadMode</span> <span class="org-string">"scroll"</span>}])
</pre>
</div>

<p>
The <code>:&gt;</code> is special Reagent syntax that allows you to easily use javascript components.
Wow, the <code>cljs</code> + <code>reagent</code> + <code>shadow-cljs</code> combo really made this process so simple!
In the process I learned something abut the philosophy of React and I understand components a bit more.
</p>
</div>
</div>

    </div>
  </section>

  <section>
    <div id="hyvor-talk-view"></div>
    <hyvor-talk-comments website-id="793" page-id="blog-comments"></hyvor-talk-comments>
  </section>

  <!-- <div class="absolute top-[110vh] ltr:right-0 rtl:left-0 w-12 pointer-events-none bottom-[-5.5rem]"> -->
  <!--   <a href="#the-top" class="w-12 h-12 sticky pointer-events-auto top-[calc(100vh-5rem)] bg-neutral/50 dark:bg-neutral-800/50 backdrop-blur rounded-full text-xl flex items-center justify-center text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400" aria-label="Scroll to top" title="Scroll to top">↑</a> -->
  <!-- </div> -->

</article>

    </main>

    <footer class="py-10 print:hidden">
      
      <div class="flex justify-between">
  <div>
    <p class="text-sm text-neutral-500 dark:text-neutral-400">&copy;
      Luca Cambiaghi
    </p>
    <p class="text-xs text-neutral-500 dark:text-neutral-400">Theme inspired by
      <a class="hover:underline hover:decoration-primary-400 hover:text-primary-500" href="https://git.io/hugo-congo" target=_blank rel="noopener noreferrer">Congo</a>
    </p>
  </div>
  <div class="text-sm cursor-pointer text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400 ltr:mr-14 rtl:ml-14">
    <button id=appearance-switcher class="w-12 h-12" type=button title="Switch to dark appearance">
      <span class="inline dark:hidden"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z"/></svg></span></span><span class="hidden dark:inline"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z"/></svg></span></span></button></div></div>

      
    </footer>

  </body>
</html>
